In [1]:
import awscli
import selenium
import boto3
import os
import s3fs 
import pandas as pd
import time
from selenium import webdriver

In [2]:
repo = os.path.dirname(os.path.abspath(''))

In [3]:
browser = webdriver.Chrome(os.path.join(repo, "ResourceDatasets", "chromedriver.exe"))

#enter the url path that needs to be accessed by webdriver
browser.get('https://data.cccnewyork.org/data/table/66/median-incomes#66/107/62/a/a')
time.sleep(5)
#identify xpath of location to select element
table = browser.find_element_by_xpath("/html/body/div[1]/div[2]/div[2]/div[3]/div/table")
df =[]

#loop through dataframe to export table
for row in table.find_elements_by_css_selector('tr'):
      cols = df.append([cell.text for cell in row.find_elements_by_css_selector('td')])

defined_columns = ['location','all_households','families','families_with_children','families_without_children']

In [4]:
df_median_BOROUGHS = pd.DataFrame(df, columns=df[1])[4:9].reset_index(drop=True)
df_median_BOROUGHS.columns = defined_columns
df_median_BOROUGHS

,location,all_households,families,families_with_children,families_without_children
0,Bronx,"$41,432","$50,835","$41,129","$61,248"
1,Brooklyn,"$66,937","$74,422","$66,936","$79,400"
2,Manhattan,"$93,651","$126,690","$140,841","$121,669"
3,Queens,"$73,696","$82,534","$75,501","$86,501"
4,Staten Island,"$89,821","$105,438","$104,641","$106,015"

In [5]:
df_median_DISTRICTS = pd.DataFrame(df, columns=df[1])[10:69].reset_index(drop=True)
df_median_DISTRICTS['Rank / Location'] = [df_median_DISTRICTS['Rank / Location'][i][:-6] for i in range(len(df_median_DISTRICTS))]
df_median_DISTRICTS.columns = defined_columns
df_median_DISTRICTS

,location,all_households,families,families_with_children,families_without_children
0,Astoria,"$79,180","$88,662","$75,972","$92,755"
1,Battery Park/Tribeca,"$162,092","$230,219","$250,001","$204,568"
2,Bay Ridge,"$76,569","$89,345","$91,935","$87,713"
3,Bayside,"$92,682","$108,371","$120,639","$102,316"
4,Bedford Park,"$41,336","$47,784","$40,863","$56,260"
5,Bedford Stuyvesant,"$61,186","$62,050","$45,782","$73,065"
6,Bensonhurst,"$57,139","$64,755","$59,268","$67,307"
7,Borough Park,"$55,071","$57,904","$51,587","$62,144"
8,Brownsville,"$31,345","$40,578","$28,585","$49,580"
9,Bushwick,"$66,275","$61,653","$56,129","$66,280"
10,Canarsie,"$80,471","$93,207","$90,463","$93,909"
11,Central Harlem,"$54,932","$61,606","$51,599","$69,025"
12,Chelsea/Clinton,"$120,248","$186,093","$155,955","$190,740"
13,Concourse/Highbridge,"$32,559","$41,687","$36,914","$49,117"
14,Coney Island,"$40,711","$52,000","$50,855","$52,491"
15,Crown Heights North,"$74,429","$81,329","$88,351","$76,379"
16,Crown Heights South,"$66,701","$71,983","$60,688","$78,110"
17,East Flatbush,"$60,895","$72,723","$67,436","$74,895"
18,East Harlem,"$32,408","$40,114","$34,242","$50,505"
19,East New York,"$45,991","$51,274","$46,386","$58,357"
20,East Tremont,"$23,605","$35,295","$27,471","$42,407"
21,Elmhurst/Corona,"$67,143","$67,886","$58,182","$78,892"
22,Flatbush/Midwood,"$65,599","$78,076","$68,911","$85,968"
23,Flushing,"$54,933","$63,497","$62,011","$64,190"
24,Fort Greene/Brooklyn Hts,"$111,546","$140,272","$190,541","$127,884"
25,Fresh Meadows/Briarwood,"$72,166","$85,373","$76,256","$88,152"
26,Greenwich Village,"$162,092","$230,219","$250,001","$204,568"
27,Howard Beach,"$84,258","$94,897","$77,002","$103,883"
28,Hunts Point,"$25,074","$35,196","$22,437","$43,680"
29,Jackson Heights,"$67,201","$66,791","$51,864","$70,584"
30,Jamaica/St. Albans,"$65,744","$78,138","$69,223","$82,264"
31,Lower East Side,"$41,302","$42,400","$38,510","$45,183"
32,Manhattanville,"$68,370","$88,914","$112,317","$84,861"
33,Midtown Business District,"$120,248","$186,093","$155,955","$190,740"
34,Morrisania,"$23,605","$35,295","$27,471","$42,407"
35,Mott Haven,"$25,074","$35,196","$22,437","$43,680"
36,Murray Hill/Stuyvesant,"$154,501","$219,465","$247,577","$217,813"
37,Park Slope,"$155,250","$191,442","$203,243","$178,700"
38,Pelham Parkway,"$58,204","$67,636","$53,222","$74,441"
39,Queens Village,"$94,789","$103,586","$103,134","$103,730"
40,Rego Park/Forest Hills,"$89,160","$120,120","$134,289","$105,599"
41,Ridgewood/Glendale,"$72,781","$79,730","$75,686","$83,002"
42,Riverdale,"$61,248","$71,037","$67,656","$74,414"
43,Sheepshead Bay,"$75,127","$90,440","$80,477","$104,165"
44,South Beach,"$82,089","$92,195","$81,748","$95,935"
45,St. George,"$75,180","$100,016","$81,392","$104,187"
46,Sunnyside/Woodside,"$80,913","$95,035","$79,362","$105,726"
47,Sunset Park,"$67,871","$69,809","$58,391","$85,443"
48,The Rockaways,"$55,034","$62,257","$60,043","$69,755"
49,Throgs Neck,"$61,029","$70,728","$61,417","$71,236"
50,Tottenville,"$108,025","$125,123","$122,406","$126,728"
51,Unionport/Soundview,"$43,975","$52,378","$41,767","$57,920"
52,University Heights,"$32,025","$41,941","$38,093","$46,311"
53,Upper East Side,"$134,264","$225,919","$250,001","$179,869"
54,Upper West Side,"$136,735","$242,446","$250,001","$236,136"
55,Washington Heights,"$53,507","$59,517","$51,839","$63,179"
56,Williamsbridge,"$60,228","$68,854","$55,352","$76,192"
57,Williamsburg/Greenpoint,"$98,284","$81,507","$74,327","$88,784"
58,Woodhaven,"$76,978","$87,282","$91,903","$85,907"

In [6]:
df_median_ZipCodes = pd.DataFrame(df, columns=df[1])[70:].reset_index(drop=True)
df_median_ZipCodes['Rank / Location'] = [df_median_ZipCodes['Rank / Location'][i][-5:] for i in range(len(df_median_ZipCodes))]
df_median_ZipCodes.columns = defined_columns
df_median_ZipCodes

,location,all_households,families,families_with_children,families_without_children
0,10001,"$92,840","$122,776","$106,452","$132,545"
1,10002,"$36,982","$40,045","$42,054","$38,639"
2,10003,"$118,161","$183,787","$250,001","$153,480"
3,10004,"$190,223","$205,202","$244,000","$204,130"
4,10005,"$189,702","$241,094","$250,001","$202,042"
...,...,...,...,...,...
176,11691,"$50,267","$61,360","$60,325","$64,441"
177,11692,"$46,819","$50,516","$42,614","$57,188"
178,11693,"$60,569","$66,250","$62,188","$67,741"
179,11694,"$84,485","$111,046","$120,943","$107,721"
180,11697,"$105,750","$123,438","$189,400","$115,000"

In [7]:
df = pd.concat([df_median_BOROUGHS, df_median_DISTRICTS, df_median_ZipCodes])
df

,location,all_households,families,families_with_children,families_without_children
0,Bronx,"$41,432","$50,835","$41,129","$61,248"
1,Brooklyn,"$66,937","$74,422","$66,936","$79,400"
2,Manhattan,"$93,651","$126,690","$140,841","$121,669"
3,Queens,"$73,696","$82,534","$75,501","$86,501"
4,Staten Island,"$89,821","$105,438","$104,641","$106,015"
...,...,...,...,...,...
176,11691,"$50,267","$61,360","$60,325","$64,441"
177,11692,"$46,819","$50,516","$42,614","$57,188"
178,11693,"$60,569","$66,250","$62,188","$67,741"
179,11694,"$84,485","$111,046","$120,943","$107,721"
180,11697,"$105,750","$123,438","$189,400","$115,000"

In [8]:
###LOAD THE FILE INTO S3####
# prepare csv file name   
pathname = 'ia-final-project-bucket/'#specify location of s3:/{my-bucket}/
filenames = f"{pathname}nyc_BOROUGHS_median_income_info.csv" #name of the filepath and csv file

#encoding must be adjusted to accommodate abnormal characters. Use s3fs to write to S3 bucket
byte_encoded_df = df_median_BOROUGHS.to_csv(None, index=False).encode() #encodes file as binary
s3 = s3fs.S3FileSystem(anon=False)
with s3.open(filenames, 'wb') as file:
    file.write(byte_encoded_df) #writes byte-encoded file to s3 location

#print success message
print("Successfull uploaded file to location:"+str(filenames))

Successfull uploaded file to location:ia-final-project-bucket/nyc_BOROUGHS_median_income_info.csv

In [9]:
###LOAD THE FILE INTO S3####
# prepare csv file name   
pathname = 'ia-final-project-bucket/'#specify location of s3:/{my-bucket}/
filenames = f"{pathname}nyc_ZipCodes_median_income_info.csv" #name of the filepath and csv file

#encoding must be adjusted to accommodate abnormal characters. Use s3fs to write to S3 bucket
byte_encoded_df = df_median_ZipCodes.to_csv(None, index=False).encode() #encodes file as binary
s3 = s3fs.S3FileSystem(anon=False)
with s3.open(filenames, 'wb') as file:
    file.write(byte_encoded_df) #writes byte-encoded file to s3 location

#print success message
print("Successfull uploaded file to location:"+str(filenames))

Successfull uploaded file to location:ia-final-project-bucket/nyc_ZipCodes_median_income_info.csv

In [10]:
###LOAD THE FILE INTO S3####
# prepare csv file name   
pathname = 'ia-final-project-bucket/'#specify location of s3:/{my-bucket}/
filenames = f"{pathname}nyc_DISTRICTS_median_income_info.csv" #name of the filepath and csv file

#encoding must be adjusted to accommodate abnormal characters. Use s3fs to write to S3 bucket
byte_encoded_df = df_median_DISTRICTS.to_csv(None, index=False).encode() #encodes file as binary
s3 = s3fs.S3FileSystem(anon=False)
with s3.open(filenames, 'wb') as file:
    file.write(byte_encoded_df) #writes byte-encoded file to s3 location

#print success message
print("Successfull uploaded file to location:"+str(filenames))

Successfull uploaded file to location:ia-final-project-bucket/nyc_DISTRICTS_median_income_info.csv